; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem miconic-92)
 (:domain miconic)
 (:objects 
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 f9 f10 f11 f12 f13 f14 f15 f16 f17 f18 f19 - floor
    )
 (:init 
    (lift-at f10)
    (origin p1 f6)
    (destin p1 f19)
    (origin p2 f18)
    (destin p2 f14)
    (origin p3 f4)
    (destin p3 f3)
    (origin p4 f14)
    (destin p4 f8)
    (origin p5 f6)
    (destin p5 f10)
    (origin p6 f9)
    (destin p6 f7)
    (origin p7 f16)
    (destin p7 f1)
    (origin p8 f13)
    (destin p8 f9)
    (origin p9 f14)
    (destin p9 f2)
    (origin p10 f11)
    (destin p10 f7)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f1 f9)
    (above f1 f10)
    (above f1 f11)
    (above f1 f12)
    (above f1 f13)
    (above f1 f14)
    (above f1 f15)
    (above f1 f16)
    (above f1 f17)
    (above f1 f18)
    (above f1 f19)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f2 f9)
    (above f2 f10)
    (above f2 f11)
    (above f2 f12)
    (above f2 f13)
    (above f2 f14)
    (above f2 f15)
    (above f2 f16)
    (above f2 f17)
    (above f2 f18)
    (above f2 f19)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f3 f9)
    (above f3 f10)
    (above f3 f11)
    (above f3 f12)
    (above f3 f13)
    (above f3 f14)
    (above f3 f15)
    (above f3 f16)
    (above f3 f17)
    (above f3 f18)
    (above f3 f19)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f4 f9)
    (above f4 f10)
    (above f4 f11)
    (above f4 f12)
    (above f4 f13)
    (above f4 f14)
    (above f4 f15)
    (above f4 f16)
    (above f4 f17)
    (above f4 f18)
    (above f4 f19)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f5 f9)
    (above f5 f10)
    (above f5 f11)
    (above f5 f12)
    (above f5 f13)
    (above f5 f14)
    (above f5 f15)
    (above f5 f16)
    (above f5 f17)
    (above f5 f18)
    (above f5 f19)
    (above f6 f7)
    (above f6 f8)
    (above f6 f9)
    (above f6 f10)
    (above f6 f11)
    (above f6 f12)
    (above f6 f13)
    (above f6 f14)
    (above f6 f15)
    (above f6 f16)
    (above f6 f17)
    (above f6 f18)
    (above f6 f19)
    (above f7 f8)
    (above f7 f9)
    (above f7 f10)
    (above f7 f11)
    (above f7 f12)
    (above f7 f13)
    (above f7 f14)
    (above f7 f15)
    (above f7 f16)
    (above f7 f17)
    (above f7 f18)
    (above f7 f19)
    (above f8 f9)
    (above f8 f10)
    (above f8 f11)
    (above f8 f12)
    (above f8 f13)
    (above f8 f14)
    (above f8 f15)
    (above f8 f16)
    (above f8 f17)
    (above f8 f18)
    (above f8 f19)
    (above f9 f10)
    (above f9 f11)
    (above f9 f12)
    (above f9 f13)
    (above f9 f14)
    (above f9 f15)
    (above f9 f16)
    (above f9 f17)
    (above f9 f18)
    (above f9 f19)
    (above f10 f11)
    (above f10 f12)
    (above f10 f13)
    (above f10 f14)
    (above f10 f15)
    (above f10 f16)
    (above f10 f17)
    (above f10 f18)
    (above f10 f19)
    (above f11 f12)
    (above f11 f13)
    (above f11 f14)
    (above f11 f15)
    (above f11 f16)
    (above f11 f17)
    (above f11 f18)
    (above f11 f19)
    (above f12 f13)
    (above f12 f14)
    (above f12 f15)
    (above f12 f16)
    (above f12 f17)
    (above f12 f18)
    (above f12 f19)
    (above f13 f14)
    (above f13 f15)
    (above f13 f16)
    (above f13 f17)
    (above f13 f18)
    (above f13 f19)
    (above f14 f15)
    (above f14 f16)
    (above f14 f17)
    (above f14 f18)
    (above f14 f19)
    (above f15 f16)
    (above f15 f17)
    (above f15 f18)
    (above f15 f19)
    (above f16 f17)
    (above f16 f18)
    (above f16 f19)
    (above f17 f18)
    (above f17 f19)
    (above f18 f19)
)
 (:goal (and 
(served p3)
(served p5)
(served p8)
(served p6)
))
)

; plan
1. (down f10 f4)
   deleted: (lift-at f10)
   added: (lift-at f4)
   goals met: 0 of 4
2. (board f4 p3)
   added: (boarded p3)
   goals met: 0 of 4
3. (down f4 f3)
   deleted: (lift-at f4)
   added: (lift-at f3)
   goals met: 0 of 4
4. (depart f3 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 1 of 4
5. (up f3 f13)
   deleted: (lift-at f3)
   added: (lift-at f13)
   goals met: 1 of 4
6. (board f13 p8)
   added: (boarded p8)
   goals met: 1 of 4
7. (down f13 f6)
   deleted: (lift-at f13)
   added: (lift-at f6)
   goals met: 1 of 4
8. (board f6 p5)
   added: (boarded p5)
   goals met: 1 of 4
9. (up f6 f10)
   deleted: (lift-at f6)
   added: (lift-at f10)
   goals met: 1 of 4
10. (depart f10 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 2 of 4
11. (down f10 f9)
   deleted: (lift-at f10)
   added: (lift-at f9)
   goals met: 2 of 4
12. (depart f9 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 3 of 4
13. (board f9 p6)
   added: (boarded p6)
   goals met: 3 of 4
14. (down f9 f7)
   deleted: (lift-at f9)
   added: (lift-at f7)
   goals met: 3 of 4
15. (depart f7 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 4 of 4
